; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        ; (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=7, packages=17, locations=16, max_capacity=3, out_folder=training/easy, instance_id=96, seed=137

(define (problem transport-96)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 v7 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 l15 l16 - location
    c0 c1 c2 c3 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c1)
    (capacity v3 c2)
    (capacity v4 c2)
    (capacity v5 c1)
    (capacity v6 c1)
    (capacity v7 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (capacity-predecessor c2 c3)
    (at p1 l12)
    (at p2 l1)
    (at p3 l13)
    (at p4 l11)
    (at p5 l13)
    (at p6 l16)
    (at p7 l5)
    (at p8 l14)
    (at p9 l11)
    (at p10 l1)
    (at p11 l1)
    (at p12 l5)
    (at p13 l16)
    (at p14 l12)
    (at p15 l6)
    (at p16 l12)
    (at p17 l8)
    (at v1 l16)
    (at v2 l13)
    (at v3 l11)
    (at v4 l11)
    (at v5 l1)
    (at v6 l13)
    (at v7 l11)
    (road l14 l10)
    (road l5 l13)
    (road l4 l15)
    (road l11 l8)
    (road l13 l5)
    (road l16 l1)
    (road l2 l14)
    (road l16 l13)
    (road l7 l10)
    (road l3 l6)
    (road l5 l12)
    (road l8 l11)
    (road l10 l11)
    (road l9 l13)
    (road l11 l10)
    (road l10 l14)
    (road l15 l4)
    (road l13 l10)
    (road l13 l16)
    (road l12 l5)
    (road l14 l2)
    (road l4 l1)
    (road l9 l6)
    (road l10 l7)
    (road l10 l13)
    (road l1 l4)
    (road l13 l9)
    (road l1 l16)
    (road l6 l3)
    (road l6 l9)
    (road l3 l12)
    (road l12 l3)
    (road l1 l3)
    (road l3 l1)
    (road l14 l15)
    (road l15 l14)
    (road l9 l10)
    (road l10 l9)
    (road l2 l4)
    (road l4 l2)
    (road l13 l15)
    (road l15 l13)
    (road l4 l8)
    (road l8 l4)
    (road l5 l11)
    (road l11 l5)
    (road l2 l6)
    (road l6 l2)
    (road l7 l14)
    (road l14 l7)
    (road l5 l16)
    (road l16 l5)
    (road l5 l10)
    (road l10 l5)
    (road l6 l12)
    (road l12 l6)
    (road l2 l8)
    (road l8 l2)
    (road l3 l10)
    (road l10 l3)
    (road l7 l15)
    (road l15 l7)
    (road l1 l14)
    (road l14 l1)
    (road l4 l10)
    (road l10 l4)
    (road l2 l3)
    (road l3 l2)
    (road l15 l16)
    (road l16 l15)
    (road l1 l7)
    (road l7 l1)
    (road l4 l7)
    (road l7 l4)
    (road l6 l15)
    (road l15 l6)
    (road l13 l14)
    (road l14 l13)
    (road l3 l11)
    (road l11 l3)
    (road l1 l12)
    (road l12 l1)
    (road l9 l15)
    (road l15 l9)
    (road l4 l16)
    (road l16 l4)
    (road l1 l8)
    (road l8 l1)
    )
 (:goal  (and 
    (at p1 l13)
    (at p2 l10)
    (at p3 l12)
    (at p4 l1)
    (at p5 l12)
    (at p6 l13)
    (at p7 l9)
    (at p8 l11)
    (at p9 l13)
    (at p10 l9)
    (at p11 l13)
    (at p12 l8)
    (at p13 l4)
    (at p14 l9)
    (at p15 l3)
    (at p16 l10)
    (at p17 l11))))

; plan
1. (drive v1 l16 l1)
   deleted: (at v1 l16)
   added: (at v1 l1)
   goals met: 0 of 17
2. (drive v1 l1 l12)
   deleted: (at v1 l1)
   added: (at v1 l12)
   goals met: 0 of 17
3. (pick-up v1 l12 p1 c0 c1)
   deleted: (at p1 l12) (capacity v1 c1)
   added: (in p1 v1) (capacity v1 c0)
   goals met: 0 of 17
4. (drive v1 l12 l5)
   deleted: (at v1 l12)
   added: (at v1 l5)
   goals met: 0 of 17
5. (drive v1 l5 l13)
   deleted: (at v1 l5)
   added: (at v1 l13)
   goals met: 0 of 17
6. (drop v1 l13 p1 c0 c1)
   deleted: (in p1 v1) (capacity v1 c0)
   added: (at p1 l13) (capacity v1 c1)
   goals met: 1 of 17
7. (drive v1 l13 l16)
   deleted: (at v1 l13)
   added: (at v1 l16)
   goals met: 1 of 17
8. (drive v1 l16 l1)
   deleted: (at v1 l16)
   added: (at v1 l1)
   goals met: 1 of 17
9. (pick-up v1 l1 p2 c0 c1)
   deleted: (at p2 l1) (capacity v1 c1)
   added: (in p2 v1) (capacity v1 c0)
   goals met: 1 of 17
10. (drive v1 l1 l4)
   deleted: (at v1 l1)
   added: (at v1 l4)
   goals met: 1 of 17
11. (drive v1 l4 l10)
   deleted: (at v1 l4)
   added: (at v1 l10)
   goals met: 1 of 17
12. (drop v1 l10 p2 c0 c1)
   deleted: (in p2 v1) (capacity v1 c0)
   added: (at p2 l10) (capacity v1 c1)
   goals met: 2 of 17
13. (drive v1 l10 l13)
   deleted: (at v1 l10)
   added: (at v1 l13)
   goals met: 2 of 17
14. (pick-up v1 l13 p3 c0 c1)
   deleted: (at p3 l13) (capacity v1 c1)
   added: (in p3 v1) (capacity v1 c0)
   goals met: 2 of 17
15. (drive v1 l13 l5)
   deleted: (at v1 l13)
   added: (at v1 l5)
   goals met: 2 of 17
16. (drive v1 l5 l12)
   deleted: (at v1 l5)
   added: (at v1 l12)
   goals met: 2 of 17
17. (drop v1 l12 p3 c0 c1)
   deleted: (in p3 v1) (capacity v1 c0)
   added: (at p3 l12) (capacity v1 c1)
   goals met: 3 of 17
18. (drive v1 l12 l5)
   deleted: (at v1 l12)
   added: (at v1 l5)
   goals met: 3 of 17
19. (drive v1 l5 l11)
   deleted: (at v1 l5)
   added: (at v1 l11)
   goals met: 3 of 17
20. (pick-up v1 l11 p4 c0 c1)
   deleted: (at p4 l11) (capacity v1 c1)
   added: (in p4 v1) (capacity v1 c0)
   goals met: 3 of 17
21. (drive v1 l11 l8)
   deleted: (at v1 l11)
   added: (at v1 l8)
   goals met: 3 of 17
22. (drive v1 l8 l1)
   deleted: (at v1 l8)
   added: (at v1 l1)
   goals met: 3 of 17
23. (drop v1 l1 p4 c0 c1)
   deleted: (in p4 v1) (capacity v1 c0)
   added: (at p4 l1) (capacity v1 c1)
   goals met: 4 of 17
24. (drive v1 l1 l16)
   deleted: (at v1 l1)
   added: (at v1 l16)
   goals met: 4 of 17
25. (drive v1 l16 l13)
   deleted: (at v1 l16)
   added: (at v1 l13)
   goals met: 4 of 17
26. (pick-up v1 l13 p5 c0 c1)
   deleted: (at p5 l13) (capacity v1 c1)
   added: (in p5 v1) (capacity v1 c0)
   goals met: 4 of 17
27. (drive v1 l13 l5)
   deleted: (at v1 l13)
   added: (at v1 l5)
   goals met: 4 of 17
28. (drive v1 l5 l12)
   deleted: (at v1 l5)
   added: (at v1 l12)
   goals met: 4 of 17
29. (drop v1 l12 p5 c0 c1)
   deleted: (in p5 v1) (capacity v1 c0)
   added: (at p5 l12) (capacity v1 c1)
   goals met: 5 of 17
30. (drive v1 l12 l5)
   deleted: (at v1 l12)
   added: (at v1 l5)
   goals met: 5 of 17
31. (drive v1 l5 l16)
   deleted: (at v1 l5)
   added: (at v1 l16)
   goals met: 5 of 17
32. (pick-up v1 l16 p6 c0 c1)
   deleted: (at p6 l16) (capacity v1 c1)
   added: (in p6 v1) (capacity v1 c0)
   goals met: 5 of 17
33. (drive v1 l16 l13)
   deleted: (at v1 l16)
   added: (at v1 l13)
   goals met: 5 of 17
34. (drop v1 l13 p6 c0 c1)
   deleted: (in p6 v1) (capacity v1 c0)
   added: (at p6 l13) (capacity v1 c1)
   goals met: 6 of 17
35. (drive v1 l13 l5)
   deleted: (at v1 l13)
   added: (at v1 l5)
   goals met: 6 of 17
36. (pick-up v1 l5 p7 c0 c1)
   deleted: (at p7 l5) (capacity v1 c1)
   added: (in p7 v1) (capacity v1 c0)
   goals met: 6 of 17
37. (drive v1 l5 l13)
   deleted: (at v1 l5)
   added: (at v1 l13)
   goals met: 6 of 17
38. (drive v1 l13 l9)
   deleted: (at v1 l13)
   added: (at v1 l9)
   goals met: 6 of 17
39. (drop v1 l9 p7 c0 c1)
   deleted: (in p7 v1) (capacity v1 c0)
   added: (at p7 l9) (capacity v1 c1)
   goals met: 7 of 17
40. (drive v1 l9 l13)
   deleted: (at v1 l9)
   added: (at v1 l13)
   goals met: 7 of 17
41. (drive v1 l13 l14)
   deleted: (at v1 l13)
   added: (at v1 l14)
   goals met: 7 of 17
42. (pick-up v1 l14 p8 c0 c1)
   deleted: (at p8 l14) (capacity v1 c1)
   added: (in p8 v1) (capacity v1 c0)
   goals met: 7 of 17
43. (drive v1 l14 l10)
   deleted: (at v1 l14)
   added: (at v1 l10)
   goals met: 7 of 17
44. (drive v1 l10 l11)
   deleted: (at v1 l10)
   added: (at v1 l11)
   goals met: 7 of 17
45. (drop v1 l11 p8 c0 c1)
   deleted: (in p8 v1) (capacity v1 c0)
   added: (at p8 l11) (capacity v1 c1)
   goals met: 8 of 17
46. (pick-up v1 l11 p9 c0 c1)
   deleted: (at p9 l11) (capacity v1 c1)
   added: (in p9 v1) (capacity v1 c0)
   goals met: 8 of 17
47. (drive v1 l11 l10)
   deleted: (at v1 l11)
   added: (at v1 l10)
   goals met: 8 of 17
48. (drive v1 l10 l13)
   deleted: (at v1 l10)
   added: (at v1 l13)
   goals met: 8 of 17
49. (drop v1 l13 p9 c0 c1)
   deleted: (in p9 v1) (capacity v1 c0)
   added: (at p9 l13) (capacity v1 c1)
   goals met: 9 of 17
50. (drive v1 l13 l16)
   deleted: (at v1 l13)
   added: (at v1 l16)
   goals met: 9 of 17
51. (drive v1 l16 l1)
   deleted: (at v1 l16)
   added: (at v1 l1)
   goals met: 9 of 17
52. (pick-up v1 l1 p10 c0 c1)
   deleted: (at p10 l1) (capacity v1 c1)
   added: (in p10 v1) (capacity v1 c0)
   goals met: 9 of 17
53. (drive v1 l1 l4)
   deleted: (at v1 l1)
   added: (at v1 l4)
   goals met: 9 of 17
54. (drive v1 l4 l15)
   deleted: (at v1 l4)
   added: (at v1 l15)
   goals met: 9 of 17
55. (drive v1 l15 l9)
   deleted: (at v1 l15)
   added: (at v1 l9)
   goals met: 9 of 17
56. (drop v1 l9 p10 c0 c1)
   deleted: (in p10 v1) (capacity v1 c0)
   added: (at p10 l9) (capacity v1 c1)
   goals met: 10 of 17
57. (drive v1 l9 l13)
   deleted: (at v1 l9)
   added: (at v1 l13)
   goals met: 10 of 17
58. (drive v1 l13 l16)
   deleted: (at v1 l13)
   added: (at v1 l16)
   goals met: 10 of 17
59. (drive v1 l16 l1)
   deleted: (at v1 l16)
   added: (at v1 l1)
   goals met: 10 of 17
60. (pick-up v1 l1 p11 c0 c1)
   deleted: (at p11 l1) (capacity v1 c1)
   added: (in p11 v1) (capacity v1 c0)
   goals met: 10 of 17
61. (drive v1 l1 l16)
   deleted: (at v1 l1)
   added: (at v1 l16)
   goals met: 10 of 17
62. (drive v1 l16 l13)
   deleted: (at v1 l16)
   added: (at v1 l13)
   goals met: 10 of 17
63. (drop v1 l13 p11 c0 c1)
   deleted: (in p11 v1) (capacity v1 c0)
   added: (at p11 l13) (capacity v1 c1)
   goals met: 11 of 17
64. (drive v1 l13 l5)
   deleted: (at v1 l13)
   added: (at v1 l5)
   goals met: 11 of 17
65. (pick-up v1 l5 p12 c0 c1)
   deleted: (at p12 l5) (capacity v1 c1)
   added: (in p12 v1) (capacity v1 c0)
   goals met: 11 of 17
66. (drive v1 l5 l11)
   deleted: (at v1 l5)
   added: (at v1 l11)
   goals met: 11 of 17
67. (drive v1 l11 l8)
   deleted: (at v1 l11)
   added: (at v1 l8)
   goals met: 11 of 17
68. (drop v1 l8 p12 c0 c1)
   deleted: (in p12 v1) (capacity v1 c0)
   added: (at p12 l8) (capacity v1 c1)
   goals met: 12 of 17
69. (drive v1 l8 l4)
   deleted: (at v1 l8)
   added: (at v1 l4)
   goals met: 12 of 17
70. (drive v1 l4 l16)
   deleted: (at v1 l4)
   added: (at v1 l16)
   goals met: 12 of 17
71. (pick-up v1 l16 p13 c0 c1)
   deleted: (at p13 l16) (capacity v1 c1)
   added: (in p13 v1) (capacity v1 c0)
   goals met: 12 of 17
72. (drive v1 l16 l4)
   deleted: (at v1 l16)
   added: (at v1 l4)
   goals met: 12 of 17
73. (drop v1 l4 p13 c0 c1)
   deleted: (in p13 v1) (capacity v1 c0)
   added: (at p13 l4) (capacity v1 c1)
   goals met: 13 of 17
74. (drive v1 l4 l1)
   deleted: (at v1 l4)
   added: (at v1 l1)
   goals met: 13 of 17
75. (drive v1 l1 l12)
   deleted: (at v1 l1)
   added: (at v1 l12)
   goals met: 13 of 17
76. (pick-up v1 l12 p14 c0 c1)
   deleted: (at p14 l12) (capacity v1 c1)
   added: (in p14 v1) (capacity v1 c0)
   goals met: 13 of 17
77. (drive v1 l12 l6)
   deleted: (at v1 l12)
   added: (at v1 l6)
   goals met: 13 of 17
78. (drive v1 l6 l9)
   deleted: (at v1 l6)
   added: (at v1 l9)
   goals met: 13 of 17
79. (drop v1 l9 p14 c0 c1)
   deleted: (in p14 v1) (capacity v1 c0)
   added: (at p14 l9) (capacity v1 c1)
   goals met: 14 of 17
80. (drive v1 l9 l6)
   deleted: (at v1 l9)
   added: (at v1 l6)
   goals met: 14 of 17
81. (pick-up v1 l6 p15 c0 c1)
   deleted: (at p15 l6) (capacity v1 c1)
   added: (in p15 v1) (capacity v1 c0)
   goals met: 14 of 17
82. (drive v1 l6 l3)
   deleted: (at v1 l6)
   added: (at v1 l3)
   goals met: 14 of 17
83. (drop v1 l3 p15 c0 c1)
   deleted: (in p15 v1) (capacity v1 c0)
   added: (at p15 l3) (capacity v1 c1)
   goals met: 15 of 17
84. (drive v1 l3 l12)
   deleted: (at v1 l3)
   added: (at v1 l12)
   goals met: 15 of 17
85. (pick-up v1 l12 p16 c0 c1)
   deleted: (at p16 l12) (capacity v1 c1)
   added: (in p16 v1) (capacity v1 c0)
   goals met: 15 of 17
86. (drive v1 l12 l5)
   deleted: (at v1 l12)
   added: (at v1 l5)
   goals met: 15 of 17
87. (drive v1 l5 l10)
   deleted: (at v1 l5)
   added: (at v1 l10)
   goals met: 15 of 17
88. (drop v1 l10 p16 c0 c1)
   deleted: (in p16 v1) (capacity v1 c0)
   added: (at p16 l10) (capacity v1 c1)
   goals met: 16 of 17
89. (drive v1 l10 l11)
   deleted: (at v1 l10)
   added: (at v1 l11)
   goals met: 16 of 17
90. (drive v1 l11 l8)
   deleted: (at v1 l11)
   added: (at v1 l8)
   goals met: 16 of 17
91. (pick-up v1 l8 p17 c0 c1)
   deleted: (at p17 l8) (capacity v1 c1)
   added: (in p17 v1) (capacity v1 c0)
   goals met: 16 of 17
92. (drive v1 l8 l11)
   deleted: (at v1 l8)
   added: (at v1 l11)
   goals met: 16 of 17
93. (drop v1 l11 p17 c0 c1)
   deleted: (in p17 v1) (capacity v1 c0)
   added: (at p17 l11) (capacity v1 c1)
   goals met: 17 of 17
